# Pandas - Práctica

In [1]:
import numpy as np
import pandas as pd

## Calentamiento

Considera el siguiente diccionario y lista.


```
data = {
     'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
     'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
     'visits': np.random.randint(8, size=10),
     'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']
}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
```

1. Crea un DataFrame con el diccionario *data* que tenga como índices los valores de la lista *labels*.

  animal  age  visits priority
0    cat  2.5       2      yes
1    cat  3.0       6      yes
2  snake  0.5       7       no
3    dog  NaN       7      yes
4    dog  5.0       6       no
5    cat  2.0       5       no
6  snake  4.5       2       no
7    cat  NaN       7      yes
8    dog  7.0       4       no
9    dog  3.0       3       no

2. Muestra una descripción o información básica acerca del DataFrame y sus datos. (Pista: existe una función que lo muestra).

Animal        object
Edad         float64
Visitas        int64
Prioridad     object
dtype: object

       Animal      Edad    Visitas Prioridad
count      10  8.000000  10.000000        10
unique      3       NaN        NaN         2
top       dog       NaN        NaN     False
freq        4       NaN        NaN         6
mean      NaN  3.437500   1.900000       NaN
std       NaN  2.007797   0.875595       NaN
min       NaN  0.500000   1.000000       NaN
25%       NaN  2.375000   1.000000       NaN
50%       NaN  3.000000   2.000000       NaN
75%       NaN  4.625000   2.750000       NaN
max       NaN  7.000000   3.000000       NaN

<class 'pandas.core.frame.DataFrame'>
MultiIndex: 10 entries, (a,) to (j,)
Data columns (total 4 columns):
Animal       10 non-null object
Edad         8 non-null float64
Visitas      10 non-null int64
Prioridad    10 non-null object
dtypes: float64(1), int64(1), object(2)
memory usage: 746.0+ bytes

4. Regresa las primeras 3 filas del DataFrame

  Animal  Edad  Visitas Prioridad
a    cat   2.5        1      True
b    cat   3.0        3      True
c  snake   0.5        2     False

4. Cambia el nombre de las columnas por:


*   Animal
*   Edad
*   Visitas
*   Prioridad

  Animal  Edad  Visitas Prioridad
a    cat   2.5        1       yes
b    cat   3.0        3       yes
c  snake   0.5        2        no
d    dog   NaN        3       yes
e    dog   5.0        2        no
f    cat   2.0        3        no
g  snake   4.5        1        no
h    cat   NaN        1       yes
i    dog   7.0        2        no
j    dog   3.0        1        no

5. Muestra solo la columna "animal" and "age". ¿Esto es posible? Si no es posible, ¿qué debería ser?

6. Selecciona solo las filas donde el número de visitas sea mayor que 3.

  Animal  Edad  Visitas Prioridad
b    cat   3.0        3       yes
d    dog   NaN        3       yes
f    cat   2.0        3        no

7. ¿Cuáles son las filas donde la edad es NaN?

  Animal  Edad  Visitas Prioridad
d    dog   NaN        3       yes
h    cat   NaN        1       yes

8. ¿Qué animales tienen una edad entre 2 y 4 años?

9. ¿Cuál es el total de todas las visitas?

10. Tenemos diferentes animales, ¿cuál es el número total de cada tipo de animal?

dog      4
cat      4
snake    2
Name: Animal, dtype: int64

12. Cambia los valores de la columna Prioridad por valores booleanos, es decir:
'yes' => True 
'no' => False

a    yes
b    yes
c     no
d    yes
e     no
f     no
g     no
h    yes
i     no
j     no
Name: Prioridad, dtype: object

a     True
b     True
c    False
d     True
e    False
f    False
g    False
h     True
i    False
j    False
Name: Prioridad, dtype: object

13. Ordena el DataFrame por la Edad en orden descendiente y después por la columna Visitas en orden ascendente.

  Animal  Edad  Visitas Prioridad
a    cat   2.5        1      True
g  snake   4.5        1     False
h    cat   NaN        1      True
j    dog   3.0        1     False
c  snake   0.5        2     False
e    dog   5.0        2     False
i    dog   7.0        2     False
b    cat   3.0        3      True
d    dog   NaN        3      True
f    cat   2.0        3     False

14. Para cada tipo de animal y cada número de visitas encuentra la edad promedio. 
(Pista: Si haz utilizado tablas pivotes, cada fila es un animal, cada columna es el número de visitas y los valores son la media de la edad).

                Edad
Animal Visitas
cat    1         2.5
       3         2.5
dog    1         3.0
       2         6.0
       3         NaN
snake  1         4.5
       2         0.5

## Ejercicio Práctico

Descargue los archivos de: https://bit.ly/2L2AvyZ

### 1 Archivo *movies*

1. Crear el Dataframe  

2. ¿Conocemos los datos?
    - Columnas
    - Tamaño 
    - Tipos de datos

3. Renombrar las columnas ID, Titulo, Genero

4. ¿Hay Valores nulos (NaN) en las columnas?

5. Regresa algunas secciones
    - Segunda Columna ¿Acaso los valores son únicos?
    - Registro número 40

### 2. Archivo ratings
1. ¿Conocemos los datos? 
    - ¿Entendemos todos?

2. Obtengamos los estadísticos básicos de las calificaciones 

3. Cambiemos la escala de las calificaciones de un máximo de 5 a 100

4. ¿Cuántas calificaciones tiene cada película? ¿Cuál es la calificación media de cada uno? 
    Nota: agrupen las calificaciones y cuenten las clasificaciones 

5. ¿cuáles son las películas son las 20 mejores  y peores según las calificaciones? ¿Cuáles son las más calificadas?

### 3. Pongamonos serios:

1. La columna de genero en el DataFrame tiene divisiones, ¿podemos poner cada genero en una columna? 
2. Concatena las nuevas columnas y quita la columna vieja

## Ejercicios Extra
- #3de3
- [The Happiness Report](https://runestone.academy/runestone/books/published/httlads/Happiness/introduction.html)
- [Detecting COVID-19 using Deep Learning](https://towardsdatascience.com/detecting-covid-19-using-deep-learning-262956b6f981)